"""Модуль с константами для меню регистрации"""


class RegistrationButtons:
    """Класс содержит константы для кнопок регистрации"""
    GET_NUMBER = 'Предоставить номер'


class RegistrationMessages:
    """Класс содержит константы для сообщений при регистрации"""
    GREETING = ('Привет. Меня зовут Фуражкин и я готов вам помочь.\n'
                'для продолжения, пожалуйста, предоставьте свой номер')
    TYPE_NUMBER = 'Пожалуйста, напишите номер без пробелов и скобок, и отправьте его в чат'
    SUCCESS_LOGIN = 'Вы вошли, ваш номер:'
    FAILED_LOGIN = 'Кажется вы неверно указали номер, попробуйте еще раз'
