class Messages:
    need_phone = "📱 ля входа отправьте номер телефона в формате +7XXXXXXXXXX или нажмите кнопку ниже:"
    ask_name = "Как тебя зовут?"
    ask_surname = "Твоя фамилия?"
    ask_email = "Напиши свой электронный адрес"
    ask_age = "Укажи свой возраст"
    ask_city = "Из какого ты города?"

    invalid_name = "❌ Не похоже на имя. Попробуйте ещё раз."
    invalid_surname = "❌ Не похоже на фамилию. Попробуйте ещё раз."
    invalid_email = "❌ Неверный формат email. Попробуйте ещё раз."
    invalid_age = "❌ Не похоже на возраст. Попробуйте ещё раз."
    invalid_city = "❌ Не похоже на город. Попробуйте ещё раз."

    registration_complete = "✅ Регистрация завершена!"
    

    ask_phone_for_add = "📱 Введите номер телефона (+7...) пользователя, которого хотите сделать админом:"
    ask_phone_for_remove = "📱 Введите номер телефона (+7...) пользователя, у которого нужно забрать права админа:"
    invalid_phone = "❌ Некорректный номер. Убедитесь, что номер в формате +7XXXXXXXXXX."
    user_not_found = "⚠️ Такого пользователя нет в базе данных."
    admin_added = "✅ Пользователь назначен администратором."
    admin_removed = "✅ Роль администратора снята."
